;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; Git config mode
;;(package! gitconfig-mode
  ;;:recipe (:host github :repo "magit/git-mode"
           ;;:files ("gitconfig-mode.el")))

;; Git ignore mode
;;(package! gitignore-mode
  ;;:recipe (:host github :repo "magit/git-modes"
           ;;:files ("gitignore-mode.el")))

;; Evil Tutor
(package! evil-tutor)

(package! centaur-tabs)

;; All the icons
(package! all-the-icons)

;; Clang format
(package! clang-format)

;; Treemacs icons
(package! treemacs-all-the-icons)

;; LISP slime
(package! slime)

(package! org-super-agenda)
(package! org-bullets)

(package! sql-indent)

(package! info-colors)
